Autodesk.Revit.DB.SpatialElementCalculationPoint.Position
The position of the "in" spatial element calculation point.
Remarks:
This is the search point where a family instance will be considered to be located inside a room/space.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.SpatialElementCalculationPoint
SpatialElementCalculationPoint is used as the search point for family instances
placement inside rooms and spaces.
Remarks:
The Spatial Element Calculation Point is graphically showed as a location point
marker with a "snake" line from the origin of the family. If the
Spatial Element Calculation Point is turned on, this point will be used as a
search point for room and space relations for all instances of this family.
Since:
2013